{
  "books": [
    {
      "id": 1,
      "name": "Dune",
      "author": "Frank Herbert",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555447414i/44767458.jpg",
      "summary": "It tells the story of young Paul Atreides, whose family accepts the stewardship of the planet Arrakis. While the planet is an inhospitable and sparsely populated desert wasteland, it is the only source of melange, or 'spice', a drug that extends life and enhances mental abilities."
    },
    {
      "id": 2,
      "name": "1984",
      "author": "George Orwell",
      "image": "https://m.media-amazon.com/images/I/41gH8Q32oFL.jpg",
      "summary": "The story of a man questioning the system that keeps his futuristic but dystopian society afloat and the chaos that quickly ensues once he gives in to his natural curiosity and desire to be free."
    },
    {
      "id": 3,
      "name": "The Dispossesed",
      "author": "Ursula K. Le Guin",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1353467455i/13651.jpg",
      "summary": "The Dispossessed tells the story of Shevek, a physicist from the anarchist society of Anarres who returns to Urras, the planet from where his ancestors departed about 200 years ago, in order to 'unbuild walls' (8) that have kept the twin planets apart both in ideological and practical terms, with only sparse and slow communication between them."
    },
    {
      "id": 4,
      "name": "Fahrenheit 451",
      "author": "Ray Bradbury",
      "image": "https://schsnews.org/wp-content/uploads/2022/05/OwCsiy0XTOJMjoWuZ3lBB4ldNvUfsBv03KaytcSt-603x900.jpeg",
      "summary": "Fahrenheit 451 tells the story of Guy Montag and his transformation from a book-burning fireman to a book-reading rebel. Montag lives in an oppressive society that attempts to eliminate all sources of complexity, contradiction, and confusion to ensure uncomplicated happiness for all its citizens."
    },
    {
      "id": 5,
      "name": "The Martian",
      "author": "Andy Weir",
      "image": "https://static01.nyt.com/images/2014/02/05/books/05before-and-after-slide-T6H2/05before-and-after-slide-T6H2-superJumbo.jpg?quality=75&auto=webp&disable=upscale",
      "summary": "The Martian tells the story of Mark Watney, an astronaut on the Ares 3 mission to Mars. After a terrible storm almost destroys the ship and the base, the crew of his ship believe he is dead. Alone on the red planet, he has to survive until the next mission to Mars arrives."
    },
    {
      "id": 6,
      "name": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/6/25/1435245979235/047c9878-9845-473c-9635-5f32545746b0-1355x2040.jpeg?width=700&quality=85&auto=format&fit=max&s=606433bda33c8c27c5ebd7ba85900473",
      "summary": "The Hitchhiker's Guide centers on permanently bemused human protagonist Arthur Dent, who wanders the Universe after the destruction of Earth with alien travel writer Ford Prefect and a crew of oddities including two-headed galactic president Zaphod Beeblebrox, an unhappy robot named Marvin and Trillian, an astrophysicist."
    },
    {
      "id": 7,
      "name": "Slaughterhouse-Five",
      "author": "Kurt Vonnegut",
      "image": "https://www.marshall.edu/library/files/2021/09/slaughterhouse5.jpg",
      "summary": "Slaughterhouse-Five's central topic is the horror of the Dresden bombing. As a witness to the destruction, Billy confronts fundamental questions about the meanings of life and death. Traumatized by the events in Dresden, Billy can provide no answers."
    },
    {
      "id": 8,
      "name": "Ender's Game",
      "author": "Orson Scott Card",
      "image": "https://m.media-amazon.com/images/I/51YfSAtW63L.jpg",
      "summary": "The novel tells the story of a young boy, Ender Wiggin, who is sent to a training academy named Battle School, located in orbit above the Earth, built to train people to become soldiers that will one day battle against a vast alien race known as 'Buggers'."
    },
    {
      "id": 9,
      "name": "A Clockwork Orange",
      "author": "Anthony Burgess",
      "image": "https://m.media-amazon.com/images/I/61ZOrcA12tL._AC_UF1000,1000_QL80_.jpg",
      "summary": "Set in a dismal dystopian England, it is the first-person account of a juvenile delinquent who undergoes state-sponsored psychological rehabilitation for his aberrant behaviour. The novel satirizes extreme political systems that are based on opposing models of the perfectibility or incorrigibility of humanity."
    },
    {
      "id": 10,
      "name": "Kindred",
      "author": "Octavia E. Butler",
      "image": "https://upload.wikimedia.org/wikipedia/en/5/57/OctaviaEButler_Kindred.jpg",
      "summary": "Kindred includes Dana time traveling back to the 1800s in Maryland from 1976. She is required to save the life of her ancestor, Rufus, each time she returns to the past in order to ensure that her ancestral line survives."
    },
    {
      "id": 11,
      "name": "The Lord of the Rings",
      "author": "J. R. R. Tolkien",
      "image": "https://prodimage.images-bn.com/pimages/9780063271265_p0_v2_s1200x630.jpg",
      "summary": "Frodo, a Christlike figure, learns that the ring has the power to control the entire world and, he discovers, to corrupt its owner. A fellowship of hobbits, elves, dwarfs, and men is formed to destroy the ring by casting it into the volcanic fires of the Crack of Doom, where it was forged."
    },
    {
      "id": 12,
      "name": "The Chronicles of Narnia",
      "author": "C. S. Lewis",
      "image": "https://upload.wikimedia.org/wikipedia/en/c/cb/The_Chronicles_of_Narnia_box_set_cover.jpg",
      "summary": "The Chronicles of Narnia follows a group of children who are evacuated to the English countryside during WWII. The books tell of the their adventures in the imaginary kingdom of Narnia, guided by a talking lion named Aslan, as they fight the White Witch and restore the throne to its rightful line."
    },
    {
      "id": 13,
      "name": "Harry Potter and the Sorcerer's Stone",
      "author": "J. K. Rowling",
      "image": "https://frugalbookstore.net/cdn/shop/products/sorcerer_s.jpg?v=1675226870",
      "summary": "The book is about 11 year old Harry Potter, who receives a letter saying that he is invited to attend Hogwarts, school of witchcraft and wizardry. He then learns that a powerful wizard and his minions are after the sorcerer's stone that will make this evil wizard immortal and undefeatable."
    },
    {
      "id": 14,
      "name": "A Game of Thrones",
      "author": "George R. R. Martin",
      "image": "https://upload.wikimedia.org/wikipedia/en/9/93/AGameOfThrones.jpg",
      "summary": "A Game of Thrones takes place over the course of one year on or near the fictional continent of Westeros. The story begins when King Robert visits the northern castle Winterfell to ask Ned Stark to be his right-hand assistant, or Hand of the King. The previous Hand, Jon Arryn, died under suspicious circumstances."
    },
    {
      "id": 15,
      "name": "Maximum Ride: The Angel Experiment",
      "author": "James Patterson",
      "image": "https://m.media-amazon.com/images/I/91Td2ZvUGzL._AC_UF1000,1000_QL80_.jpg",
      "summary": "The Flock, led by Maximum 'Max' Ride, are a group of kids genetically altered to have wings. They live in hiding in a house in the woods after being freed by one of the scientists, Jeb Batchelder, now presumed deceased."
    },
    {
      "id": 16,
      "name": "Foundation",
      "author": "Isaac Asimov",
      "image": "https://m.media-amazon.com/images/I/41sIWKtP-4L.jpg",
      "summary": "For twelve thousand years the Galactic Empire has ruled supreme. Now it is dying. But only Hari Seldon, creator of the revolutionary science of psychohistory, can see into the future--to a dark age of ignorance, barbarism, and warfare that will last thirty thousand years."
    },
    {
      "id": 17,
      "name": "Brave New World",
      "author": "Aldous Huxley",
      "image": "https://m.media-amazon.com/images/I/71aDrgLp9CL._AC_UF1000,1000_QL80_.jpg",
      "summary": "The novel examines a futuristic society, called the World State, that revolves around science and efficiency. In this society, emotions and individuality are conditioned out of children at a young age, and there are no lasting relationships because “every one belongs to every one else” (a common World State dictum)."
    },
    {
      "id": 18,
      "name": "The Princess Bride",
      "author": "William Goldman",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327903636i/21787.jpg",
      "summary": "Beautiful, flaxen-haired Buttercup has fallen for Westley, the farm boy, and when he departs to make his fortune, she vows never to love another. So when she hears that his ship has been captured by the Dread Pirate Roberts - who never leaves survivors - her heart is broken."
    },
    {
      "id": 19,
      "name": "Animal Farm",
      "author": "George Orwell",
      "image": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781839642395/animal-farm-9781839642395_hr.jpg",
      "summary": "It tells the story of a group of anthropomorphic farm animals who rebel against their human farmer, hoping to create a society where the animals can be equal, free, and happy. Ultimately, the rebellion is betrayed, and under the dictatorship of a pig named Napoleon, the farm ends up in a state as bad as it was before."
    },
    {
      "id": 20,
      "name": "I, Robot",
      "author": "Isaac Asimov",
      "image": "https://d3525k1ryd2155.cloudfront.net/h/205/779/1511779205.0.l.jpg",
      "summary": "I, Robot, a collection of nine short stories by science-fiction writer Isaac Asimov that imagines the development of “positronic” (humanlike, with a form of artificial intelligence) robots and wrestles with the moral implications of the technology."
    },
    {
      "id": 21,
      "name": "Frankenstein",
      "author": "Mary Shelley",
      "image": "https://s3.amazonaws.com/adg-bucket/frankenstein-mary-shelley/2233-medium.jpg",
      "summary": "Frankenstein tells the story of gifted scientist Victor Frankenstein who succeeds in giving life to a being of his own creation. However, this is not the perfect specimen he imagines that it will be, but rather a hideous creature who is rejected by Victor and mankind in general."
    },
    {
      "id": 22,
      "name": "2001, A Space Odyssey",
      "author": "Arthur C. Clarke",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1432468943i/70535.jpg",
      "summary": "The story follows the growth of human civilization from primitive hominids. Distinctively, Space Odyssey is concerned about not only the evolution that has led to the development of humanity, but also the evolution that humanity might undergo in the future. Hence, we follow Bowman as he is turned into a Star Child."
    },
    {
      "id": 23,
      "name": "Cat's Cradle",
      "author": "Kurt Vonnegut",
      "image": "https://m.media-amazon.com/images/I/81NIfUlv2DL._AC_UF1000,1000_QL80_.jpg",
      "summary": "In Cat's Cradle (1963) some Caribbean islanders, who practice a religion consisting of harmless trivialities, come into contact with a substance discovered by an atomic scientist that eventually destroys all life on Earth."
    },
    {
      "id": 24,
      "name": "A Canticle for Leibowitz",
      "author": "Walter M. Miller Jr.",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1450516880i/164154.jpg",
      "summary": "A Canticle for Leibowitz is a post-apocalyptic social science fiction novel. Set in a Catholic monastery in the desert of the southwestern United States after a devastating nuclear war, the book spans thousands of years as civilization rebuilds itself."
    },
    {
      "id": 25,
      "name": "The War of the End of the World",
      "author": "Mario Vargas Llosa",
      "image": "https://m.media-amazon.com/images/I/81vZAOEEonL._AC_UF1000,1000_QL80_.jpg",
      "summary": "In an epic final clash, a whole army is sent to extirpate Canudos and instigates a terrible and brutal battle with the poor while politicians of the old order see their world destroyed in the conflagration."
    },
    {
      "id": 26,
      "name": "Nine Princes in Amber",
      "author": "Roger Zelazny",
      "image": "https://d3525k1ryd2155.cloudfront.net/h/490/580/440580490.0.x.jpg",
      "summary": "In the story, Carl Corey wakes up in a secluded New York hospital with amnesia. He escapes and investigates, discovering the truth, piece by piece: he is really Prince Corwin, of Amber, the one true world of which the Earth is just a shadow."
    },
    {
      "id": 27,
      "name": "The Mists of Avalon",
      "author": "Marion Zimmer Bradley",
      "image": "https://upload.wikimedia.org/wikipedia/en/3/37/Mists_of_Avalon-1st_ed.jpg",
      "summary": "The Mists of Avalon is an epic tale of love, loyalty, betrayal, kingship, and magic. It takes place over several decades and two generations. It tells the fabled tale of Camelot and the Knights of the Round Table. Taking a different view from the legend, it is told from the perspective of the women of Avalon."
    },
    {
      "id": 28,
      "name": "Ringworld",
      "author": "Larry Niven",
      "image": "https://m.media-amazon.com/images/I/51d7TuzknhL.jpg",
      "summary": "Ringworld tells the story of Louis Wu and his companions on a mission to the Ringworld, a rotating wheel artificial world, an alien construct in space 186 million miles (299 million kilometres) in diameter."
    },
    {
      "id": 29,
      "name": "The Left Hand of Darkness",
      "author": "Ursula K. Le Guin",
      "image": "https://m.media-amazon.com/images/I/91AMkAkM6eL._AC_UF1000,1000_QL80_.jpg",
      "summary": "The Left Hand of Darkness tells the story of a lone human emissary to Winter, an alien world whose inhabitants can change their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization."
    },
    {
      "id": 30,
      "name": "the Silmarillion",
      "author": "J. R. R. Tolkien",
      "image": "https://m.media-amazon.com/images/I/41DC+nuiFFL.jpg",
      "summary": "The Silmarillion is the history of the rebellion of Fëanor and his kindred against the gods, their exile from Valinor and return to Middle-earth, and their war, hopeless despite all their heroism, against the great Enemy."
    },
    {
      "id": 31,
      "name": "Contact",
      "author": "Carl Sagan",
      "image": "https://upload.wikimedia.org/wikipedia/en/5/55/Contact_Sagan.jpg",
      "summary": "The story primarily revolves around Dr. Eleanor 'Ellie' Arroway, a brilliant scientist and radio astronomer who becomes the focal point of humanity's first contact with an alien civilization. Through her tireless efforts, Ellie and her team at the Arecibo Observatory in Puerto Rico discover a series of mysterious signals originating from the star Vega, more than 25 light-years away."
    },
    {
      "id": 32,
      "name": "Stardust",
      "author": "Neil Gaiman",
      "image": "https://m.media-amazon.com/images/I/415mLXznHzL.jpg",
      "summary": "Young Tristran Thorn has lost his heart to the beautiful Victoria Forester and, to win her love, vows to bring her a star they see fall from the night sky. It is an oath that sends him over the town's ancient wall and into the mysterious land of Faerie - a world that is dangerous and strange beyond imagining ."
    },
    {
      "id": 33,
      "name": "World War Z",
      "author": "Max Brooks",
      "image": "https://www.duckworthbooks.co.uk/wp-content/uploads/2021/12/9780715653739.jpg",
      "summary": "World War Z chronicles the stories of people from all walks of life, from military scientists, to blind old Japanese men, to astronauts aboard the ISS, and their stories of how they survived the terrors of the assault of the living dead."
    },
    {
      "id": 34,
      "name": "Fantastic Beasts and Where to Find Them",
      "author": "J. K. Rowling",
      "image": "https://m.media-amazon.com/images/I/51XXxJ0uQzL.jpg",
      "summary": "Fantastic Beasts follows a magical young man named Newt on a journey to find his beasts that escaped. Newt Scamander is a wizard unlike any other, he uses not only his powers but the powers of his magical animals."
    },
    {
      "id": 35,
      "name": "Roadside Picnic",
      "author": "Arkady Strugatsky and Boris Strugatsky",
      "image": "https://m.media-amazon.com/images/I/71bTfyuIBeL._AC_UF1000,1000_QL80_.jpg",
      "summary": "The story revolves around Redrick 'Red' Schuhart, a tough and experienced young stalker who regularly enters the Zone illegally at night in search of valuable artifacts for profit. Trying to clean up his act, he becomes employed as a lab assistant at the International Institute, which studies the Zone."
    },
    {
      "id": 36,
      "name": "Jonathan Strange & Mr. Norrell",
      "author": "Susanna Clarke",
      "image": "https://markusmcdowell.com/wp-content/uploads/2018/02/cover-jonathan-strange-and-mr-norrell-1.jpg",
      "summary": "This novel creates an alternate history in which magic is a part of England's history and its future. The two title characters engage in a battle over the proper use of that magic, leading to unintended consequences."
    },
    {
      "id": 37,
      "name": "Journey to the Center of the Earth",
      "author": "Jules Verne",
      "image": "https://mpd-biblio-covers.imgix.net/9781466803541.jpg",
      "summary": "A geology professor, Otto Lidenbrock, and his nephew Axel discover and decode an ancient document that purports to show that a dormant volcano holds a secret entrance to a series of caverns leading to a subterranean world at the earth's center."
    },
    {
      "id": 38,
      "name": "The Hunger Games",
      "author": "Suzanne Collins",
      "image": "https://m.media-amazon.com/images/I/41tqzW6kO7S.jpg",
      "summary": "The story is about Katniss Everdeen, a sixteen-year-old girl. Her father died and now she has to kill animals for her family to eat. Her younger sister, Prim, is chosen to be a “tribute”, but Katniss volunteers to go instead. The other “tribute” from District 12 is a boy named Peeta."
    },
    {
      "id": 39,
      "name": "Divergent",
      "author": "Veronica Roth",
      "image": "https://d3525k1ryd2155.cloudfront.net/h/372/407/718407372.0.l.jpg",
      "summary": "Divergent is a dark and thrilling young adult sci-fi series from best-selling author Veronica Roth. It's set in a post-apocalyptic Chicago that has separated its population into five Factions, each defined by a given set of values, personality traits, and social affiliations."
    },
    {
      "id": 40,
      "name": "Wicked",
      "author": "Gregory Maguire",
      "image": "https://karinbeery.com/wp-content/uploads/2021/12/wicked.jpg",
      "summary": "It is presented as a biography of the Wicked Witch of the West, here given the name 'Elphaba.' The book follows Elphaba from her birth as the result of a rape through her radicalization, social ostracism, and finally her death at the hands of Dorothy Gale."
    },
    {
      "id": 41,
      "name": "American Gods",
      "author": "Neil Gaiman",
      "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/49/American_gods.jpg/220px-American_gods.jpg",
      "summary": "Shadow is an ex-convict who is released from prison three days early when his wife Laura is killed in a car accident. Shadow is devastated by her death, and is distraught to learn that she died alongside his best friend Robbie, with whom she had been having an affair."
    },
    {
      "id": 42,
      "name": "The Eye of the World",
      "author": "Robert Jordan",
      "image": "https://m.media-amazon.com/images/I/81tBoQP5V+L._AC_UF1000,1000_QL80_.jpg",
      "summary": "The Eye of the World revolves around the three boys from Emond's Field and that has also drawn the attention of Ba'alzamon. Their regular country lives are thrown into chaos and they must flee and fight back against Trollocs as they make their way across the country."
    },
    {
      "id": 43,
      "name": "The Dragon Reborn",
      "author": "Robert Jordan",
      "image": "https://upload.wikimedia.org/wikipedia/en/9/97/WoT03_TheDragonReborn.jpg",
      "summary": "Rand al'Thor, having been declared the Dragon Reborn by Moiraine Damodred, secretly goes to Tear to prove himself. Along the way he is hunted by Darkhounds and Darkfriends. After leaving in secret, Moiraine, Lan Mandragoran, the Ogier Loial, and Perrin Aybara follow always one step behind."
    },
    {
      "id": 44,
      "name": "Neuromancer",
      "author": "William Gibson",
      "image": "https://images.squarespace-cdn.com/content/v1/51ad3961e4b0ae1d9bf5b6f1/a4f2090e-148f-4ca0-9174-48765db17223/William-Gibson-Neuromancer-Cyberpunk-Cover-Web.jpg?format=1000w",
      "summary": "It is set on Earth in the near future and its plot involves mercenary and cyber-hacking characters who must work (or rebel) under the control of megacorporations and artificial intelligence."
    },
    {
      "id": 45,
      "name": "Stranger in a Strange Land",
      "author": "Robert A. Heinlein",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1156897088i/350.jpg",
      "summary": "Stranger in a Strange Land centres on a human raised on Mars who comes to Earth and challenges customs relating to sex, death, religion, and money."
    },
    {
      "id": 46,
      "name": "The Stand",
      "author": "Stephen King",
      "image": "https://d3myrwj42s63no.cloudfront.net/300/030/774/368/3/0307743683.jpg",
      "summary": "The plot centers on a deadly pandemic of weaponized influenza and its aftermath, in which the few surviving humans gather into factions that are each led by a personification of either good or evil and seem fated to clash with each other."
    },
    {
      "id": 47,
      "name": "Snow Crash",
      "author": "Neal Stephenson",
      "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1589842551i/40651883.jpg",
      "summary": "Snow Crash revolves around Hiro, a pizza deliveryman and freelance hacker (so far, so 90s) who's roped into an investigation of an apocalyptic virus alongside his new sidekick, Y.T., a young skateboard courier surfing the freeways of near-future LA."
    },
    {
      "id": 48,
      "name": "Starship Troopers",
      "author": "Robert A. Heinlein",
      "image": "https://upload.wikimedia.org/wikipedia/en/a/a9/Starship_Troopers_%28novel%29.jpg",
      "summary": "The first-person narrative follows Juan 'Johnny' Rico, a young man of Filipino descent, through his military service in the Mobile Infantry. He progresses from recruit to officer against the backdrop of an interstellar war between humans and an alien species known as 'Arachnids' or 'Bugs'."
    },
    {
      "id": 49,
      "name": "Flowers for Algernon",
      "author": "Daniel Keyes",
      "image": "https://pylesofbooks.files.wordpress.com/2019/01/flowersforalgernon.jpg",
      "summary": "Algernon is a laboratory mouse who has undergone surgery to increase his intelligence. The story is told by a series of progress reports written by Charlie Gordon, the first human subject for the surgery, and it touches on ethical and moral themes such as the treatment of the mentally disabled."
    },
    {
      "id": 50,
      "name": "Twenty Thousand Leagues Under the Sea",
      "author": "Jules Verne",
      "image": "https://m.media-amazon.com/images/I/71zc4dyOnAL._AC_UF1000,1000_QL80_.jpg",
      "summary": "Twenty Thousand Leagues Under the Sea tells the story of three men who go to sea in search of a giant whale. They are taken prisoner on board the world's first submarine, the Nautilus. The Nautilus travels through the world's seas. The men see amazing deep-sea creatures, and they travel to remote islands."
    },
    {
      "id": 51,
      "name": "The War of the Worlds",
      "author": "H. G. Wells",
      "image": "https://m.media-amazon.com/images/I/51Uvh63U4vL.jpg",
      "summary": "The War of the Worlds is a landmark science fiction, its nameless narrator provides a firsthand account of the arrival of Martians in the area surrounding London and their subsequent devastation of central England."
    },
    {
      "id": 52,
      "name": "Neverwhere",
      "author": "Neil Gaiman",
      "image": "https://images.booksense.com/images/058/371/9780062371058.jpg",
      "summary": "It is the story of Richard Mayhew, a young London businessman with a good heart and an ordinary life, which is changed forever when he discovers a girl bleeding on the sidewalk. He stops to help her—an act of kindness that plunges him into a world he never dreamed existed."
    },
    {
      "id": 53,
      "name": "The Last Unicorn",
      "author": "Peter S. Beagle",
      "image": "https://m.media-amazon.com/images/I/81NnAGwjcVL._AC_UF1000,1000_QL80_.jpg",
      "summary": "The Last Unicorn follows the tale of a unicorn, who believes she is the last of her kind in the world and undertakes a quest to discover what has happened to the other unicorns."
    },
    {
      "id": 54,
      "name": "Small Gods",
      "author": "Terry Pratchett",
      "image": "https://www.terrypratchettbooks.com/wp-content/uploads/2019/05/9781804990193-scaled.jpg",
      "summary": "Small Gods tells the origin of the god Om, and his relations with his prophet, the reformer Brutha. In the process, it satirises philosophy, religious institutions, people, and practices, and the role of religion in political life."
    },
    {
      "id": 55,
      "name": "Going Postal",
      "author": "Terry Pratchett",
      "image": "https://www.terrypratchettbooks.com/wp-content/uploads/2019/05/Going-Postal_PB.jpg",
      "summary": "Set in Pratchett's wonderfully crazed city of Ankh-Morpork, Going Postal hilariously reflects the plight of post offices the world over as they struggle to compete in an era when e-mail has stolen much of the glamour from the postal trade."
    }
  ],
  "reviews": [
    {
      "id": 1,
      "name": "Dune",
      "author": "Frank Herbert",
      "review": "Dune, the name is thrilling in itself. A lot can be said about this beautiful world-building by Frank Herbert. It had me thrilled from the start. This is truly an example of the sheer brilliance of a science fiction novel. The characters are super good in this book. The protagonist was a complex one that even his mother couldn't understand at times. The side characters were likeable too, each one of them having their own characteristics. The setting and complexities of the habitat in which Arrakis, the desert planet is set are commendable. Surely, it would have taken a lot of imagination to create something like this. But the best thing about this novel was that how it connects with the philosophies of real-life and how it can impact an individual."
    },
    {
      "id": 2,
      "name": "The Dispossesed",
      "author": "Ursula K. Le Guin",
      "review": "The Dispossessed is phenomenal, one of the best SF novels of all time. I'll echo the recommendation for diving into more of her Hainish works. In addition to other novels, there are tons of shorter works that dive into other worlds with various social systems. Le Guin's background (her father was a famous anthropologist) really comes through in her work. You're right on the ideology, it's basically anarcho-syndicalism with Daoist influences. I actually first read The Dispossessed around the time I read George Orwell's Homage to Catalonia and it was a fascinating comparison. In some of Le Guin's collections you may find “The Day Before the Revolution,” a short story about Odo before the anarchists went to Anarres."
    }
  ],
  "favorites": [
    {
      "id": 2,
      "name": "1984",
      "author": "George Orwell",
      "image": "https://m.media-amazon.com/images/I/41gH8Q32oFL.jpg",
      "summary": "The story of a man questioning the system that keeps his futuristic but dystopian society afloat and the chaos that quickly ensues once he gives in to his natural curiosity and desire to be free."
    },
    {
      "id": 9,
      "name": "A Clockwork Orange",
      "author": "Anthony Burgess",
      "image": "https://m.media-amazon.com/images/I/61ZOrcA12tL._AC_UF1000,1000_QL80_.jpg",
      "summary": "Set in a dismal dystopian England, it is the first-person account of a juvenile delinquent who undergoes state-sponsored psychological rehabilitation for his aberrant behaviour. The novel satirizes extreme political systems that are based on opposing models of the perfectibility or incorrigibility of humanity."
    },
    {
      "id": 11,
      "name": "The Lord of the Rings",
      "author": "J. R. R. Tolkien",
      "image": "https://prodimage.images-bn.com/pimages/9780063271265_p0_v2_s1200x630.jpg",
      "summary": "Frodo, a Christlike figure, learns that the ring has the power to control the entire world and, he discovers, to corrupt its owner. A fellowship of hobbits, elves, dwarfs, and men is formed to destroy the ring by casting it into the volcanic fires of the Crack of Doom, where it was forged."
    }
  ]
}